# 5.     Напишите программу, которая принимает на вход координаты двух точек 
# и находит расстояние между ними в 2D пространстве.
#     Пример:
# - A (3,6); B (2,1) -> 5,09
# - A (7,-5); B (1,-1) -> 7,21

print('Введите координаты первой точки А')
xa=int(input('x= '))
ya=int(input('y= '))

print('Введите координаты второй точки B')
xb=int(input('x= '))
yb=int(input('y= '))

#double result=Math.Sqrt((userX2-userX1)*(userX2-userX1)+(userY2-userY1)*(userY2-userY1));
#result= Math.Round(result,2); // округление значения
#Console.WriteLine($"Расстояние между точками {userX1}:{userY1} и {userX2}:{userY2} равно {result} ");

result=